app/views/main/edit.html.erb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."team_id" = 2
---
<%= form_tag('/reset', :id => "auth-form") do %>
  <% @team.restaurants.each do |c| %>