app/views/main/index.html.erb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."team_id" = 2
---
<% @sum = 0 %>
<% @team.restaurants.each do |c| %>