app/controllers/main_controller.rb

  def index
    # init
    @current_restaurant = session[:current_restaurant]
    @team = Team.find :last
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", false]]

  def edit
    @team = Team.find :last
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 2]]

  def reset
    team = Team.find :last
    i = 1

    team.restaurants.each do |c|
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."team_id" = 1

  def rated
    team = Team.find :last
    rest_name = team.currentRestaurants.find :last
    @rest = team.restaurants.find_by_name(rest_name.name)
    r = @rest.rates.create!
    r.point = params[:point]
    r.save

    sum = 0
    times = 0
    @rest.rates.each do |c|
      sum += c.point
      times += 1
    end

    new_rate = (sum + r.point)/(times + 1)
    @rest.rate = new_rate
    @rest.save
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
SELECT "current_restaurants".* FROM "current_restaurants" WHERE "current_restaurants"."team_id" = 1 ORDER BY "current_restaurants"."id" DESC LIMIT 1
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."team_id" = 1 AND "restaurants"."name" = 1 LIMIT 1
INSERT INTO "rates" ("created_at", "point", "restaurant_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 28 Jan 2013 15:38:24 UTC +00:00], ["point", nil], ["restaurant_id", 1], ["updated_at", Mon, 28 Jan 2013 15:38:24 UTC +00:00]]
UPDATE "rates" SET "point" = 2.0, "updated_at" = '2013-01-28 15:38:24.344007' WHERE "rates"."id" = 11
SELECT "rates".* FROM "rates" WHERE "rates"."restaurant_id" = 1
UPDATE "restaurants" SET "rate" = 1.75, "updated_at" = '2013-01-28 15:38:45.935718' WHERE "restaurants"."id" = 1

  def rate
    @team = Team.find :last
    @current_restaurant = @team.currentRestaurants.find :last
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
SELECT "current_restaurants".* FROM "current_restaurants" WHERE "current_restaurants"."team_id" = 1 ORDER BY "current_restaurants"."id" DESC LIMIT 1

  def pick
    team = Team.find :last
    all = 0
    team.restaurants.each do |c|
      all += c.rate
    end
    result = Random.rand(0...all)

    sum = 0
    team.restaurants.each do |c|
      sum += c.rate
      if(sum >= result)
        cr = team.currentRestaurants.create!
        cr.name = c.name
        cr.save
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."team_id" = 1
INSERT INTO "current_restaurants" ("created_at", "name", "team_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 28 Jan 2013 11:10:05 UTC +00:00], ["name", nil], ["team_id", 1], ["updated_at", Mon, 28 Jan 2013 11:10:05 UTC +00:00]]
UPDATE "current_restaurants" SET "name" = 'pizza hut', "updated_at" = '2013-01-28 11:10:05.169282' WHERE "current_restaurants"."id" = 1

  def init
      team = Team.create!
      team.name = "Drupal"
      r = team.restaurants.create!
      r.name = "KFC"
      r.rate = 5
      rp = r.rates.create!
      rp.point = r.rate
      rp.save
      r.save
---
INSERT INTO "teams" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 28 Jan 2013 10:10:04 UTC +00:00], ["name", nil], ["updated_at", Mon, 28 Jan 2013 10:10:04 UTC +00:00]]
INSERT INTO "restaurants" ("created_at", "name", "rate", "team_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 28 Jan 2013 10:10:04 UTC +00:00], ["name", nil], ["rate", nil], ["team_id", 1], ["updated_at", Mon, 28 Jan 2013 10:10:04 UTC +00:00]]
INSERT INTO "rates" ("created_at", "point", "restaurant_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 28 Jan 2013 11:41:51 UTC +00:00], ["point", nil], ["restaurant_id", 1], ["updated_at", Mon, 28 Jan 2013 11:41:51 UTC +00:00]]
UPDATE "rates" SET "point" = 1.0, "updated_at" = '2013-01-28 11:41:51.825385' WHERE "rates"."id" = 1
UPDATE "restaurants" SET "name" = 'KFC', "rate" = 1.0, "updated_at" = '2013-01-28 10:10:04.941060' WHERE "restaurants"."id" = 1
UPDATE "teams" SET "name" = 'Drupal', "updated_at" = '2013-01-28 10:10:04.982843' WHERE "teams"."id" = 1